Revit 2024 API
RoofComponents.ScaledDepth Property
 The depth of the roof slab.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public double ScaledDepth { get; }
Visual Basic
Public ReadOnly Property ScaledDepth As Double
	Get
Visual C++
public:
property double ScaledDepth {
	double get ();
}
See Also
RoofComponents Class
Autodesk.Revit.DB.IFC Namespace